In [1]:
import pandas as pd

# Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [2]:
df_movies = pd.read_csv(r'c:\Users\mkskr\Downloads\ml-25m\movies.csv')
df_movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [3]:
df_ratings = pd.read_csv(r'c:\Users\mkskr\Downloads\ml-25m\ratings.csv')
df_ratings.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [4]:
df_movies = df_movies.merge(df_ratings, on=['movieId'] , how='left')
df_movies['quantity'] = 1
df_movies.head()

,movieId,title,genres,userId,rating,timestamp,quantity
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,2.0,3.5,1.141416e+09,1
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3.0,4.0,1.439472e+09,1
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,4.0,3.0,1.573944e+09,1
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5.0,4.0,8.586259e+08,1
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,8.0,4.0,8.904925e+08,1

In [5]:
df_movies.query('rating == 5', inplace = True)
df_movies.head()

,movieId,title,genres,userId,rating,timestamp,quantity
10,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,36.0,5.0,8.571314e+08,1
22,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,75.0,5.0,1.537208e+09,1
25,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,86.0,5.0,9.454628e+08,1
26,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,90.0,5.0,8.635380e+08,1
27,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,93.0,5.0,1.496543e+09,1

In [6]:
df_movies = df_movies.groupby(['movieId', 'title', 'rating']).sum().reset_index()[['movieId', 'title', 'rating', 'quantity']].sort_values('quantity', ascending=False).reset_index(drop=True)
df_movies.head()

   movieId                                      title  rating  quantity
0      318           Shawshank Redemption, The (1994)     5.0     39553
1      296                        Pulp Fiction (1994)     5.0     32169
2      356                        Forrest Gump (1994)     5.0     25918
3      260  Star Wars: Episode IV - A New Hope (1977)     5.0     25804
4     2571                         Matrix, The (1999)     5.0     25482

In [7]:
print('наибольшее количество оценок \"5\" получил фильм: ' + df_movies['title'][0])

наибольшее количество оценок "5" получил фильм: Shawshank Redemption, The (1994)

# Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [8]:
df_power = pd.read_csv('power.csv')
df_power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [9]:

df_power = df_power[df_power.country.str.contains(r'Latvia|Lithuania|Estonia')==True]
df_power.query('year >= 2005 and year <= 2010 and quantity > 0 and category == 4 or category == 12 or category == 21', inplace = True)
df_power.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4
11158  Lithuania  2006       1.0         4
11159  Lithuania  2005       1.0         4

In [10]:
print('Суммарное потребление: ' + str(df_power['quantity'].sum()))

Суммарное потребление: 970505.0

# Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [11]:
df_tables = pd.read_html('https://www.finanz.ru/valyuty/v-realnom-vremeni', encoding='utf8')

In [12]:
df_tables[1].head()

,Unnamed: 0,Рубль,Предложение,Спрос,Предыдущее закрытие,%,Абсолютное значение,Время
0,NaN,GBP/RUB,974698,-,971764,"0,30 %",02935,18:17:00
1,NaN,EUR/RUB,888680,-,885015,"0,41 %",03665,18:16:00
2,NaN,USD/RUB,751990,-,749083,"0,39 %",02907,18:16:00
3,NaN,JPY/RUB,07178,-,07140,"0,52 %",00038,18:17:00
4,NaN,CNY/RUB,111183,-,110937,"0,22 %",00246,18:16:00